dev-roadmap.org
# -*- mode: org; fill-column: 79; -*-

#+TITLE: Developer Roadmap 2019
#+AUTHOR: Kamran Ahmed
#+DATE: <2019-01-12 Sat 10:19>
#+CREATOR: WLHarvey4
#+MACRO: VERSION 0.0.2

Below you find a set of charts demonstrating the paths that you can take and
the technologies that you would want to adopt in order to become a frontend,
backend or a devops. I made these charts for an old professor of mine who
wanted something to share with his college students to give them a perspective;
sharing them here to help the community.

@@html:<h3>@@Disclaimer@@html:</h3>@@
#+begin_aside
The purpose of these roadmaps is to give you an idea about the landscape and to
guide you if you are confused about what to learn next and not to encourage you
to pick what is hip and trendy. You should grow some understanding of why one
tool would better suited for some cases than the other and remember hip and
trendy never means best suited for the job
#+end_aside

* Roadmap for All Paths

** Git --- Version Control

   "Git is a fast distributed revision control system."

   - [[https://git-scm.com][git-scm]]
   - [[https://git-scm.com/downloads][Downloads]]
   - [[https://github.com/git][Git Source]]
   - [[https://git-scm.com/docs/user-manual.html][Git User Manual]]
   - [[https://git-scm.com/docs][Git Reference Manual]]
   - [[https://book.git-scm.com/book/en/v2][Pro Git]] by Scott Chacon

*** Git Tutorials

    - From the commandline, type ~git help tutorial~

** Basic Terminal Usage

** Data Structures and Algorithms

** SOLID --- KISS --- YAGNI

** GitHub

** Licenses

** Semantic Versioning

** SSH

** HTTP --- HTTPS --- API's

** Design Patterns

** Character Encodings

