dev-roadmap.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-01-12 Sat 10:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Developer Roadmap 2019</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Kamran Ahmed">
<meta name="description" content="Roadmap to becoming a Web Developer in 2019; https://github.com/kamranahmedse/developer-roadmap"
>
<meta name="keywords" content="roadmap developer web-developer front-end-developer back-end-developer devops">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://github.com/kamranahmedse/developer-roadmap"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">Developer Roadmap 2019</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgef7b8c9">1. Roadmap for All Paths</a>
<ul>
<li><a href="#org64becda">1.1. Git &#x2014; Version Control</a>
<ul>
<li><a href="#orgec0612f">1.1.1. Git Tutorials</a></li>
</ul>
</li>
<li><a href="#orge637cdb">1.2. Basic Terminal Usage</a></li>
<li><a href="#org604c883">1.3. Data Structures and Algorithms</a></li>
<li><a href="#org8f600e1">1.4. SOLID &#x2014; KISS &#x2014; YAGNI</a></li>
<li><a href="#org3e33423">1.5. GitHub</a></li>
<li><a href="#org9f3804d">1.6. Licenses</a></li>
<li><a href="#org91f3dfa">1.7. Semantic Versioning</a></li>
<li><a href="#org55a92a4">1.8. SSH</a></li>
<li><a href="#orge0c7cee">1.9. HTTP &#x2014; HTTPS &#x2014; API&rsquo;s</a></li>
<li><a href="#org89bcb82">1.10. Design Patterns</a></li>
<li><a href="#orga608b47">1.11. Character Encodings</a></li>
</ul>
</li>
<li><a href="#orgb855e8d">2. Front-End Roadmap</a>
<ul>
<li><a href="#org0e533be">2.1. Learn the Basics</a>
<ul>
<li><a href="#orgb0543bd">2.1.1. HTML</a></li>
<li><a href="#org626f29d">2.1.2. CSS</a></li>
<li><a href="#org2d5843f">2.1.3. Basics of JavaScript</a></li>
</ul>
</li>
<li><a href="#orgacae91c">2.2. Package Managers</a>
<ul>
<li><a href="#org8c51ddf">2.2.1. npm</a></li>
<li><a href="#org0e6f67a">2.2.2. yarn</a></li>
</ul>
</li>
<li><a href="#org2ab914e">2.3. CSS Preprocessors</a>
<ul>
<li><a href="#org3930fb3">2.3.1. SASS</a></li>
<li><a href="#orgeea09c5">2.3.2. PostCSS</a></li>
<li><a href="#org3d6e2e4">2.3.3. Less</a></li>
</ul>
</li>
<li><a href="#org995bcea">2.4. CSS Frameworks</a>
<ul>
<li><a href="#orga803f47">2.4.1. Bootstrap</a></li>
<li><a href="#orga36d8b1">2.4.2. Materialize CSS</a></li>
<li><a href="#org2ccbc3c">2.4.3. Bulma</a></li>
<li><a href="#orgbb9b9d6">2.4.4. Semantics UI</a></li>
</ul>
</li>
<li><a href="#org69c2b4e">2.5. CSS Architecture</a>
<ul>
<li><a href="#org8f3cae8">2.5.1. BEM</a></li>
<li><a href="#org1530a1c">2.5.2. OOCSS</a></li>
<li><a href="#org0f8c828">2.5.3. SMACSS</a></li>
</ul>
</li>
<li><a href="#org023a782">2.6. Build Tools</a>
<ul>
<li><a href="#org71a5ff5">2.6.1. Task Runners</a></li>
<li><a href="#orga3e8d24">2.6.2. Module Bundlers</a></li>
<li><a href="#orgf057150">2.6.3. Linters and Formatters</a></li>
</ul>
</li>
<li><a href="#org5202055">2.7. Pick a Framework</a>
<ul>
<li><a href="#orge010e15">2.7.1. ReactJS</a></li>
<li><a href="#org544f1d7">2.7.2. Angular</a></li>
<li><a href="#orgea3cd0f">2.7.3. VueJS</a></li>
</ul>
</li>
<li><a href="#org9dc589e">2.8. CSS in JS</a>
<ul>
<li><a href="#orgcb5cdcb">2.8.1. Styled Components</a></li>
<li><a href="#orgba444dc">2.8.2. CSS Modules</a></li>
<li><a href="#org2b23bb8">2.8.3. Emotion</a></li>
<li><a href="#orga53ef4c">2.8.4. Radium</a></li>
<li><a href="#org4b94a4d">2.8.5. Glamorous</a></li>
</ul>
</li>
<li><a href="#orgb7267d1">2.9. Testing Your App</a>
<ul>
<li><a href="#orgdabb8e1">2.9.1. Jest</a></li>
<li><a href="#org057ffb6">2.9.2. Enzyme</a></li>
<li><a href="#org3b0a29a">2.9.3. Cypress</a></li>
<li><a href="#orgb8b9481">2.9.4. Mocha</a></li>
<li><a href="#orge57b8f5">2.9.5. Chai</a></li>
<li><a href="#org98321b6">2.9.6. Ava</a></li>
<li><a href="#org51508d6">2.9.7. Karma</a></li>
<li><a href="#org3816c7c">2.9.8. Jasmine</a></li>
<li><a href="#org368f832">2.9.9. Protractor</a></li>
<li><a href="#orgb97cec1">2.9.10. Types of Testing</a></li>
</ul>
</li>
<li><a href="#org0e6aae7">2.10. Progressive Web Apps (PWAs)</a>
<ul>
<li><a href="#org7ac9dfc">2.10.1. Web APIs Used in PWAs</a></li>
<li><a href="#org2c770b9">2.10.2. Calculating, Measuring, and Improving Performance</a></li>
</ul>
</li>
<li><a href="#orgba45399">2.11. Type Checkers</a>
<ul>
<li><a href="#org3d3ec34">2.11.1. TypeScript</a></li>
<li><a href="#org126a7bd">2.11.2. Flow</a></li>
</ul>
</li>
<li><a href="#org7d97f27">2.12. Server Side Rendering</a>
<ul>
<li><a href="#org6dd0c78">2.12.1. ReactJS</a></li>
<li><a href="#orgadc689b">2.12.2. Angular</a></li>
<li><a href="#org706ff0f">2.12.3. VueJS</a></li>
</ul>
</li>
<li><a href="#org703c238">2.13. Static Site Generators</a>
<ul>
<li><a href="#org04dc2d3">2.13.1. Gatsby</a></li>
</ul>
</li>
<li><a href="#org129b833">2.14. Desktop Applications</a>
<ul>
<li><a href="#orgfdecc3c">2.14.1. Electron</a></li>
<li><a href="#org6482ee7">2.14.2. Proton Native</a></li>
<li><a href="#orgf3742f1">2.14.3. Carlo</a></li>
</ul>
</li>
<li><a href="#orgd3ce111">2.15. Mobile Applications</a>
<ul>
<li><a href="#orge3e0c9e">2.15.1. React Native</a></li>
<li><a href="#org2afbba2">2.15.2. NativeScript</a></li>
</ul>
</li>
<li><a href="#orgc3f99cf">2.16. Web Assembly</a></li>
<li><a href="#orge6755b8">2.17. Keep Learning</a></li>
</ul>
</li>
<li><a href="#orga02af8f">3. Back-End Roadmap</a>
<ul>
<li><a href="#org3434706">3.1. Pick a Language</a>
<ul>
<li><a href="#org1426f09">3.1.1. Scripting Languages</a></li>
<li><a href="#orgdabc23c">3.1.2. Functional Languages</a></li>
<li><a href="#org0758901">3.1.3. Other Options</a></li>
</ul>
</li>
<li><a href="#orgd774458">3.2. Practice What You Learnt</a></li>
<li><a href="#orge3543c3">3.3. Learn Package Manager</a></li>
<li><a href="#org8c6478a">3.4. Standards and Best Practices</a></li>
<li><a href="#orgeef984b">3.5. Make and Distribute Some Package or Library</a></li>
<li><a href="#orgaa39992">3.6. Learn About Testing</a></li>
<li><a href="#orgefc6b45">3.7. Write Tests for the Practical Steps Above</a></li>
<li><a href="#org313f3e8">3.8. Learn Relational Databases</a></li>
<li><a href="#org8fe1292">3.9. Practical Time</a></li>
<li><a href="#org65b56e7">3.10. Learn a Framework</a></li>
<li><a href="#org2db0d2b">3.11. Practical Time</a></li>
<li><a href="#orga953464">3.12. Learn a NoSQL Database</a></li>
<li><a href="#orgbf88e1d">3.13. Coaching</a></li>
<li><a href="#org2d85c31">3.14. Creating RESTful APIs</a></li>
<li><a href="#org42e5dcd">3.15. Authentication/Authorizations Methodologies</a></li>
<li><a href="#orga2d7cd2">3.16. Message Brokers</a></li>
<li><a href="#org6acbe6b">3.17. Learn a Search Engine</a></li>
<li><a href="#orgc1853b4">3.18. Learn How to User Docker</a></li>
<li><a href="#orge0fc542">3.19. Knowledge of Web Servers</a></li>
<li><a href="#org2031922">3.20. Learn How to Use Web Sockets</a></li>
<li><a href="#org4cc0f1b">3.21. Learn GraphQL</a></li>
<li><a href="#org61da402">3.22. Look Into Graph Databases</a></li>
<li><a href="#orgd40f678">3.23. All Things Not Mentioned Above</a></li>
<li><a href="#orged45806">3.24. Keep Exploring</a></li>
</ul>
</li>
<li><a href="#org2d8276d">4. DevOps Roadmap</a>
<ul>
<li><a href="#org7ac2792">4.1. Learn a Programming Language</a>
<ul>
<li><a href="#org1c2f9c1">4.1.1. Go</a></li>
<li><a href="#orgfdaac28">4.1.2. Rust</a></li>
<li><a href="#org0029ab2">4.1.3. C C++</a></li>
<li><a href="#org68fca0e">4.1.4. Python</a></li>
<li><a href="#org0612b39">4.1.5. Ruby</a></li>
<li><a href="#org3a6893c">4.1.6. Node.js</a></li>
</ul>
</li>
<li><a href="#orge7a97d9">4.2. Understand Different OS Concepts</a>
<ul>
<li><a href="#org93b36fd">4.2.1. I/O Management</a></li>
<li><a href="#orgfe7dcaa">4.2.2. Virtualization</a></li>
<li><a href="#org6b67850">4.2.3. Memory and Storage</a></li>
<li><a href="#org260f097">4.2.4. File Systems</a></li>
<li><a href="#org41cc5f9">4.2.5. Process Management</a></li>
<li><a href="#orgfd20121">4.2.6. Threads and Concurrency</a></li>
<li><a href="#orgbbb1dca">4.2.7. Sockets</a></li>
</ul>
</li>
<li><a href="#org3c38647">4.3. Learn About Managing Servers</a>
<ul>
<li><a href="#orgb2c291c">4.3.1. Operating Systems</a></li>
<li><a href="#org555f192">4.3.2. Learn to Live in Terminal</a></li>
</ul>
</li>
<li><a href="#org954210b">4.4. Networking and Security</a>
<ul>
<li><a href="#org7a57ced">4.4.1. OSI Model</a></li>
<li><a href="#org79855b3">4.4.2. DNS</a></li>
<li><a href="#org41bcd0e">4.4.3. HTTP/S</a></li>
<li><a href="#org8951aa8">4.4.4. FTP</a></li>
<li><a href="#orga4c35eb">4.4.5. SSL/TLS</a></li>
</ul>
</li>
<li><a href="#org05c601e">4.5. What Is and How To Set Up &#x2026;</a>
<ul>
<li><a href="#org62b3952">4.5.1. Reverse Proxy</a></li>
<li><a href="#org4d8cd70">4.5.2. Forward Proxy</a></li>
<li><a href="#org304c491">4.5.3. Coaching Server</a></li>
<li><a href="#orgdd1dcc1">4.5.4. Load Balancer</a></li>
<li><a href="#orgca79bd9">4.5.5. Firewall</a></li>
</ul>
</li>
<li><a href="#org445a137">4.6. Learn Infrastructure as Code</a>
<ul>
<li><a href="#org4c4b01d">4.6.1. Containers</a></li>
<li><a href="#orgb4070f5">4.6.2. Configuration and Management</a></li>
<li><a href="#org1bd93e1">4.6.3. Container Orchestration</a></li>
<li><a href="#orgff9a2ea">4.6.4. Infrastructure Provisioning</a></li>
</ul>
</li>
<li><a href="#org2ff3e3a">4.7. Learn Some CI/CD Tools</a>
<ul>
<li><a href="#org500eb2d">4.7.1. Jenkins</a></li>
<li><a href="#orgbf01b47">4.7.2. Travis CI</a></li>
<li><a href="#orga8cefbe">4.7.3. Teamcit</a></li>
<li><a href="#org3cb196a">4.7.4. Drone</a></li>
<li><a href="#org8efe266">4.7.5. Circle CI</a></li>
</ul>
</li>
<li><a href="#org89f8184">4.8. Learn How to Monitor Software and Infrastructure</a>
<ul>
<li><a href="#org5e8c2cd">4.8.1. Infrastructure Monitoring</a></li>
<li><a href="#org1f5031c">4.8.2. Application Monitoring</a></li>
<li><a href="#org5c9e072">4.8.3. Logs Management</a></li>
</ul>
</li>
<li><a href="#org167000b">4.9. Cloud Providers</a>
<ul>
<li><a href="#orgd5a07ce">4.9.1. AWS</a></li>
<li><a href="#org59a7377">4.9.2. Google Cloud</a></li>
<li><a href="#orgdc0b001">4.9.3. Azure</a></li>
<li><a href="#orgaf7eb22">4.9.4. Digital Ocean</a></li>
<li><a href="#org07c8a79">4.9.5. Heroku</a></li>
</ul>
</li>
<li><a href="#orgee4a01e">4.10. Keep Exploring</a></li>
</ul>
</li>
<li><a href="#org8312a2e">5. Wrap Up</a></li>
<li><a href="#orgcb708d4">6. Contribution</a></li>
<li><a href="#org3f92ef8">7. Sponsored By</a></li>
<li><a href="#org583ffbb">8. License</a></li>
</ul>
</div>
</nav>
<p>
Below you find a set of charts demonstrating the paths that you can take and
the technologies that you would want to adopt in order to become a frontend,
backend or a devops. I made these charts for an old professor of mine who
wanted something to share with his college students to give them a perspective;
sharing them here to help the community.
</p>

<p>
<h3>Disclaimer</h3>
</p>
<aside>
<p>
The purpose of these roadmaps is to give you an idea about the landscape and to
guide you if you are confused about what to learn next and not to encourage you
to pick what is hip and trendy. You should grow some understanding of why one
tool would better suited for some cases than the other and remember hip and
trendy never means best suited for the job
</p>
</aside>

<div id="outline-container-orgef7b8c9" class="outline-2">
<h2 id="orgef7b8c9"><span class="section-number-2">1</span> Roadmap for All Paths</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org64becda" class="outline-3">
<h3 id="org64becda"><span class="section-number-3">1.1</span> Git &#x2014; Version Control</h3>
<div class="outline-text-3" id="text-1-1">
<p>
&ldquo;Git is a fast distributed revision control system.&rdquo;
</p>

<ul class="org-ul">
<li><a href="https://git-scm.com">git-scm</a></li>
<li><a href="https://git-scm.com/downloads">Downloads</a></li>
<li><a href="https://github.com/git">Git Source</a></li>
<li><a href="https://git-scm.com/docs/user-manual.html">Git User Manual</a></li>
<li><a href="https://git-scm.com/docs">Git Reference Manual</a></li>
<li><a href="https://book.git-scm.com/book/en/v2">Pro Git</a> by Scott Chacon</li>
</ul>
</div>

<div id="outline-container-orgec0612f" class="outline-4">
<h4 id="orgec0612f"><span class="section-number-4">1.1.1</span> Git Tutorials</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>From the commandline, type <code>git help tutorial</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge637cdb" class="outline-3">
<h3 id="orge637cdb"><span class="section-number-3">1.2</span> Basic Terminal Usage</h3>
</div>

<div id="outline-container-org604c883" class="outline-3">
<h3 id="org604c883"><span class="section-number-3">1.3</span> Data Structures and Algorithms</h3>
</div>

<div id="outline-container-org8f600e1" class="outline-3">
<h3 id="org8f600e1"><span class="section-number-3">1.4</span> SOLID &#x2014; KISS &#x2014; YAGNI</h3>
</div>

<div id="outline-container-org3e33423" class="outline-3">
<h3 id="org3e33423"><span class="section-number-3">1.5</span> GitHub</h3>
</div>

<div id="outline-container-org9f3804d" class="outline-3">
<h3 id="org9f3804d"><span class="section-number-3">1.6</span> Licenses</h3>
</div>

<div id="outline-container-org91f3dfa" class="outline-3">
<h3 id="org91f3dfa"><span class="section-number-3">1.7</span> Semantic Versioning</h3>
</div>

<div id="outline-container-org55a92a4" class="outline-3">
<h3 id="org55a92a4"><span class="section-number-3">1.8</span> SSH</h3>
</div>

<div id="outline-container-orge0c7cee" class="outline-3">
<h3 id="orge0c7cee"><span class="section-number-3">1.9</span> HTTP &#x2014; HTTPS &#x2014; API&rsquo;s</h3>
</div>

<div id="outline-container-org89bcb82" class="outline-3">
<h3 id="org89bcb82"><span class="section-number-3">1.10</span> Design Patterns</h3>
</div>

<div id="outline-container-orga608b47" class="outline-3">
<h3 id="orga608b47"><span class="section-number-3">1.11</span> Character Encodings</h3>
</div>
</div>
