dev-roadmap.org
* Front-End Roadmap

** Learn the Basics

*** HTML

*** CSS

*** Basics of JavaScript

** Package Managers

*** npm

*** yarn

** CSS Preprocessors

*** SASS

*** PostCSS

*** Less

** CSS Frameworks

*** Bootstrap

*** Materialize CSS

*** Bulma

*** Semantics UI

** CSS Architecture

*** BEM

*** OOCSS

*** SMACSS

** Build Tools

*** Task Runners

*** Module Bundlers

*** Linters and Formatters

** Pick a Framework

*** ReactJS

*** Angular

**** RxJS

**** ngrx

*** VueJS

**** Vuex

** CSS in JS

*** Styled Components

*** CSS Modules

*** Emotion

*** Radium

*** Glamorous

** Testing Your App

*** Jest

*** Enzyme

*** Cypress

*** Mocha

*** Chai

*** Ava

*** Karma

*** Jasmine

*** Protractor

*** Types of Testing

**** Unit

**** Integration

**** Functional

** Progressive Web Apps (PWAs)

*** Web APIs Used in PWAs

**** Storage

**** Web Sockets

**** Service Workers

**** Location

**** Notifications

**** Device Orientation

**** Payments

**** Credentials

*** Calculating, Measuring, and Improving Performance

**** PRPL Pattern

**** RAIL Model

**** Performance Metrics

**** Using Light House

**** Using DevTools

** Type Checkers

*** TypeScript

*** Flow

** Server Side Rendering

*** ReactJS

**** Next.js

**** After.js

*** Angular

**** Universal

*** VueJS

**** Nuxt.js

** Static Site Generators

*** Gatsby

** Desktop Applications

*** Electron

*** Proton Native

*** Carlo

** Mobile Applications

*** React Native

*** NativeScript

** Web Assembly

** Keep Learning

* Back-End Roadmap

** Pick a Language
   There are myriads of different options.

*** Scripting Languages

**** Python

**** Ruby

**** PHP

**** Node.js

**** TypeScript

*** Functional Languages

**** Elixir

**** Scala

**** Erlang

**** Clojure

**** Haskell

*** Other Options

**** Java

**** .NET

**** Golang

**** Rust

