dev-roadmap.html

<div id="outline-container-orgb855e8d" class="outline-2">
<h2 id="orgb855e8d"><span class="section-number-2">2</span> Front-End Roadmap</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0e533be" class="outline-3">
<h3 id="org0e533be"><span class="section-number-3">2.1</span> Learn the Basics</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgb0543bd" class="outline-4">
<h4 id="orgb0543bd"><span class="section-number-4">2.1.1</span> HTML</h4>
</div>

<div id="outline-container-org626f29d" class="outline-4">
<h4 id="org626f29d"><span class="section-number-4">2.1.2</span> CSS</h4>
</div>

<div id="outline-container-org2d5843f" class="outline-4">
<h4 id="org2d5843f"><span class="section-number-4">2.1.3</span> Basics of JavaScript</h4>
</div>
</div>

<div id="outline-container-orgacae91c" class="outline-3">
<h3 id="orgacae91c"><span class="section-number-3">2.2</span> Package Managers</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org8c51ddf" class="outline-4">
<h4 id="org8c51ddf"><span class="section-number-4">2.2.1</span> npm</h4>
</div>

<div id="outline-container-org0e6f67a" class="outline-4">
<h4 id="org0e6f67a"><span class="section-number-4">2.2.2</span> yarn</h4>
</div>
</div>

<div id="outline-container-org2ab914e" class="outline-3">
<h3 id="org2ab914e"><span class="section-number-3">2.3</span> CSS Preprocessors</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org3930fb3" class="outline-4">
<h4 id="org3930fb3"><span class="section-number-4">2.3.1</span> SASS</h4>
</div>

<div id="outline-container-orgeea09c5" class="outline-4">
<h4 id="orgeea09c5"><span class="section-number-4">2.3.2</span> PostCSS</h4>
</div>

<div id="outline-container-org3d6e2e4" class="outline-4">
<h4 id="org3d6e2e4"><span class="section-number-4">2.3.3</span> Less</h4>
</div>
</div>

<div id="outline-container-org995bcea" class="outline-3">
<h3 id="org995bcea"><span class="section-number-3">2.4</span> CSS Frameworks</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orga803f47" class="outline-4">
<h4 id="orga803f47"><span class="section-number-4">2.4.1</span> Bootstrap</h4>
</div>

<div id="outline-container-orga36d8b1" class="outline-4">
<h4 id="orga36d8b1"><span class="section-number-4">2.4.2</span> Materialize CSS</h4>
</div>

<div id="outline-container-org2ccbc3c" class="outline-4">
<h4 id="org2ccbc3c"><span class="section-number-4">2.4.3</span> Bulma</h4>
</div>

<div id="outline-container-orgbb9b9d6" class="outline-4">
<h4 id="orgbb9b9d6"><span class="section-number-4">2.4.4</span> Semantics UI</h4>
</div>
</div>

<div id="outline-container-org69c2b4e" class="outline-3">
<h3 id="org69c2b4e"><span class="section-number-3">2.5</span> CSS Architecture</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org8f3cae8" class="outline-4">
<h4 id="org8f3cae8"><span class="section-number-4">2.5.1</span> BEM</h4>
</div>

<div id="outline-container-org1530a1c" class="outline-4">
<h4 id="org1530a1c"><span class="section-number-4">2.5.2</span> OOCSS</h4>
</div>

<div id="outline-container-org0f8c828" class="outline-4">
<h4 id="org0f8c828"><span class="section-number-4">2.5.3</span> SMACSS</h4>
</div>
</div>

<div id="outline-container-org023a782" class="outline-3">
<h3 id="org023a782"><span class="section-number-3">2.6</span> Build Tools</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org71a5ff5" class="outline-4">
<h4 id="org71a5ff5"><span class="section-number-4">2.6.1</span> Task Runners</h4>
</div>

<div id="outline-container-orga3e8d24" class="outline-4">
<h4 id="orga3e8d24"><span class="section-number-4">2.6.2</span> Module Bundlers</h4>
</div>

<div id="outline-container-orgf057150" class="outline-4">
<h4 id="orgf057150"><span class="section-number-4">2.6.3</span> Linters and Formatters</h4>
</div>
</div>

<div id="outline-container-org5202055" class="outline-3">
<h3 id="org5202055"><span class="section-number-3">2.7</span> Pick a Framework</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orge010e15" class="outline-4">
<h4 id="orge010e15"><span class="section-number-4">2.7.1</span> ReactJS</h4>
</div>

<div id="outline-container-org544f1d7" class="outline-4">
<h4 id="org544f1d7"><span class="section-number-4">2.7.2</span> Angular</h4>
<div class="outline-text-4" id="text-2-7-2">
</div>
<ol class="org-ol">
<li><a id="orgbc9ca95"></a>RxJS<br></li>

<li><a id="org8682fa3"></a>ngrx<br></li>
</ol>
</div>

<div id="outline-container-orgea3cd0f" class="outline-4">
<h4 id="orgea3cd0f"><span class="section-number-4">2.7.3</span> VueJS</h4>
<div class="outline-text-4" id="text-2-7-3">
</div>
<ol class="org-ol">
<li><a id="org743a9a9"></a>Vuex<br></li>
</ol>
</div>
</div>

<div id="outline-container-org9dc589e" class="outline-3">
<h3 id="org9dc589e"><span class="section-number-3">2.8</span> CSS in JS</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-orgcb5cdcb" class="outline-4">
<h4 id="orgcb5cdcb"><span class="section-number-4">2.8.1</span> Styled Components</h4>
</div>

<div id="outline-container-orgba444dc" class="outline-4">
<h4 id="orgba444dc"><span class="section-number-4">2.8.2</span> CSS Modules</h4>
</div>

<div id="outline-container-org2b23bb8" class="outline-4">
<h4 id="org2b23bb8"><span class="section-number-4">2.8.3</span> Emotion</h4>
</div>

<div id="outline-container-orga53ef4c" class="outline-4">
<h4 id="orga53ef4c"><span class="section-number-4">2.8.4</span> Radium</h4>
</div>

<div id="outline-container-org4b94a4d" class="outline-4">
<h4 id="org4b94a4d"><span class="section-number-4">2.8.5</span> Glamorous</h4>
</div>
</div>

<div id="outline-container-orgb7267d1" class="outline-3">
<h3 id="orgb7267d1"><span class="section-number-3">2.9</span> Testing Your App</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-orgdabb8e1" class="outline-4">
<h4 id="orgdabb8e1"><span class="section-number-4">2.9.1</span> Jest</h4>
</div>

<div id="outline-container-org057ffb6" class="outline-4">
<h4 id="org057ffb6"><span class="section-number-4">2.9.2</span> Enzyme</h4>
</div>

<div id="outline-container-org3b0a29a" class="outline-4">
<h4 id="org3b0a29a"><span class="section-number-4">2.9.3</span> Cypress</h4>
</div>

<div id="outline-container-orgb8b9481" class="outline-4">
<h4 id="orgb8b9481"><span class="section-number-4">2.9.4</span> Mocha</h4>
</div>

<div id="outline-container-orge57b8f5" class="outline-4">
<h4 id="orge57b8f5"><span class="section-number-4">2.9.5</span> Chai</h4>
</div>

<div id="outline-container-org98321b6" class="outline-4">
<h4 id="org98321b6"><span class="section-number-4">2.9.6</span> Ava</h4>
</div>

<div id="outline-container-org51508d6" class="outline-4">
<h4 id="org51508d6"><span class="section-number-4">2.9.7</span> Karma</h4>
</div>

<div id="outline-container-org3816c7c" class="outline-4">
<h4 id="org3816c7c"><span class="section-number-4">2.9.8</span> Jasmine</h4>
</div>

<div id="outline-container-org368f832" class="outline-4">
<h4 id="org368f832"><span class="section-number-4">2.9.9</span> Protractor</h4>
</div>

<div id="outline-container-orgb97cec1" class="outline-4">
<h4 id="orgb97cec1"><span class="section-number-4">2.9.10</span> Types of Testing</h4>
<div class="outline-text-4" id="text-2-9-10">
</div>
<ol class="org-ol">
<li><a id="org1c70622"></a>Unit<br></li>

<li><a id="orgc92d3c1"></a>Integration<br></li>

<li><a id="org9046f79"></a>Functional<br></li>
</ol>
</div>
</div>

<div id="outline-container-org0e6aae7" class="outline-3">
<h3 id="org0e6aae7"><span class="section-number-3">2.10</span> Progressive Web Apps (PWAs)</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-org7ac9dfc" class="outline-4">
<h4 id="org7ac9dfc"><span class="section-number-4">2.10.1</span> Web APIs Used in PWAs</h4>
<div class="outline-text-4" id="text-2-10-1">
</div>
<ol class="org-ol">
<li><a id="org261aec6"></a>Storage<br></li>

<li><a id="orgedbd76a"></a>Web Sockets<br></li>

<li><a id="orgf9fa2bf"></a>Service Workers<br></li>

<li><a id="orgb14688d"></a>Location<br></li>

<li><a id="org1352613"></a>Notifications<br></li>

<li><a id="orgc63f7e0"></a>Device Orientation<br></li>

<li><a id="org0bdee7a"></a>Payments<br></li>

<li><a id="org02ba62c"></a>Credentials<br></li>
</ol>
</div>

<div id="outline-container-org2c770b9" class="outline-4">
<h4 id="org2c770b9"><span class="section-number-4">2.10.2</span> Calculating, Measuring, and Improving Performance</h4>
<div class="outline-text-4" id="text-2-10-2">
</div>
<ol class="org-ol">
<li><a id="org93b37d8"></a>PRPL Pattern<br></li>

<li><a id="orge0472da"></a>RAIL Model<br></li>

<li><a id="orgb834046"></a>Performance Metrics<br></li>

<li><a id="org1cd3ee8"></a>Using Light House<br></li>

<li><a id="orga9ea121"></a>Using DevTools<br></li>
</ol>
</div>
</div>

<div id="outline-container-orgba45399" class="outline-3">
<h3 id="orgba45399"><span class="section-number-3">2.11</span> Type Checkers</h3>
<div class="outline-text-3" id="text-2-11">
</div>
<div id="outline-container-org3d3ec34" class="outline-4">
<h4 id="org3d3ec34"><span class="section-number-4">2.11.1</span> TypeScript</h4>
</div>

<div id="outline-container-org126a7bd" class="outline-4">
<h4 id="org126a7bd"><span class="section-number-4">2.11.2</span> Flow</h4>
</div>
</div>

<div id="outline-container-org7d97f27" class="outline-3">
<h3 id="org7d97f27"><span class="section-number-3">2.12</span> Server Side Rendering</h3>
<div class="outline-text-3" id="text-2-12">
</div>
<div id="outline-container-org6dd0c78" class="outline-4">
<h4 id="org6dd0c78"><span class="section-number-4">2.12.1</span> ReactJS</h4>
<div class="outline-text-4" id="text-2-12-1">
</div>
<ol class="org-ol">
<li><a id="org72e8158"></a>Next.js<br></li>

<li><a id="orgbf28500"></a>After.js<br></li>
</ol>
</div>

<div id="outline-container-orgadc689b" class="outline-4">
<h4 id="orgadc689b"><span class="section-number-4">2.12.2</span> Angular</h4>
<div class="outline-text-4" id="text-2-12-2">
</div>
<ol class="org-ol">
<li><a id="orgb3d489e"></a>Universal<br></li>
</ol>
</div>

<div id="outline-container-org706ff0f" class="outline-4">
<h4 id="org706ff0f"><span class="section-number-4">2.12.3</span> VueJS</h4>
<div class="outline-text-4" id="text-2-12-3">
</div>
<ol class="org-ol">
<li><a id="org8a32c63"></a>Nuxt.js<br></li>
</ol>
</div>
</div>

<div id="outline-container-org703c238" class="outline-3">
<h3 id="org703c238"><span class="section-number-3">2.13</span> Static Site Generators</h3>
<div class="outline-text-3" id="text-2-13">
</div>
<div id="outline-container-org04dc2d3" class="outline-4">
<h4 id="org04dc2d3"><span class="section-number-4">2.13.1</span> Gatsby</h4>
</div>
</div>

<div id="outline-container-org129b833" class="outline-3">
<h3 id="org129b833"><span class="section-number-3">2.14</span> Desktop Applications</h3>
<div class="outline-text-3" id="text-2-14">
</div>
<div id="outline-container-orgfdecc3c" class="outline-4">
<h4 id="orgfdecc3c"><span class="section-number-4">2.14.1</span> Electron</h4>
</div>

<div id="outline-container-org6482ee7" class="outline-4">
<h4 id="org6482ee7"><span class="section-number-4">2.14.2</span> Proton Native</h4>
</div>

<div id="outline-container-orgf3742f1" class="outline-4">
<h4 id="orgf3742f1"><span class="section-number-4">2.14.3</span> Carlo</h4>
</div>
</div>

<div id="outline-container-orgd3ce111" class="outline-3">
<h3 id="orgd3ce111"><span class="section-number-3">2.15</span> Mobile Applications</h3>
<div class="outline-text-3" id="text-2-15">
</div>
<div id="outline-container-orge3e0c9e" class="outline-4">
<h4 id="orge3e0c9e"><span class="section-number-4">2.15.1</span> React Native</h4>
</div>

<div id="outline-container-org2afbba2" class="outline-4">
<h4 id="org2afbba2"><span class="section-number-4">2.15.2</span> NativeScript</h4>
</div>
</div>

<div id="outline-container-orgc3f99cf" class="outline-3">
<h3 id="orgc3f99cf"><span class="section-number-3">2.16</span> Web Assembly</h3>
</div>

<div id="outline-container-orge6755b8" class="outline-3">
<h3 id="orge6755b8"><span class="section-number-3">2.17</span> Keep Learning</h3>
</div>
</div>

<div id="outline-container-orga02af8f" class="outline-2">
<h2 id="orga02af8f"><span class="section-number-2">3</span> Back-End Roadmap</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3434706" class="outline-3">
<h3 id="org3434706"><span class="section-number-3">3.1</span> Pick a Language</h3>
<div class="outline-text-3" id="text-3-1">
<p>
There are myriads of different options.
</p>
</div>

<div id="outline-container-org1426f09" class="outline-4">
<h4 id="org1426f09"><span class="section-number-4">3.1.1</span> Scripting Languages</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="orgb15928e"></a>Python<br></li>

<li><a id="org6e1ac16"></a>Ruby<br></li>

<li><a id="orgb46c789"></a>PHP<br></li>

<li><a id="orge8c2074"></a>Node.js<br></li>

<li><a id="org6cc0800"></a>TypeScript<br></li>
</ol>
</div>

<div id="outline-container-orgdabc23c" class="outline-4">
<h4 id="orgdabc23c"><span class="section-number-4">3.1.2</span> Functional Languages</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
