dev-roadmap.org
** Practice What You Learnt

** Learn Package Manager

** Standards and Best Practices

** Make and Distribute Some Package or Library

** Learn About Testing

** Write Tests for the Practical Steps Above

** Learn Relational Databases

** Practical Time

** Learn a Framework

** Practical Time

** Learn a NoSQL Database

** Coaching

** Creating RESTful APIs

** Authentication/Authorizations Methodologies

** Message Brokers

** Learn a Search Engine

** Learn How to User Docker

** Knowledge of Web Servers

** Learn How to Use Web Sockets

** Learn GraphQL

** Look Into Graph Databases

** All Things Not Mentioned Above

** Keep Exploring

* DevOps Roadmap

** Learn a Programming Language

*** Go

*** Rust

*** C C++

*** Python

*** Ruby

*** Node.js

** Understand Different OS Concepts

*** I/O Management

*** Virtualization

*** Memory and Storage

*** File Systems

*** Process Management

*** Threads and Concurrency

*** Sockets

** Learn About Managing Servers

*** Operating Systems

**** Linux

**** Unix

**** Windows

*** Learn to Live in Terminal

**** Bash Scripting

**** Vim/Nano/PowerShell/Emacs

**** Compiling Apps from Source

**** System Performance

**** Others

** Networking and Security

*** OSI Model

*** DNS

*** HTTP/S

*** FTP

*** SSL/TLS

** What Is and How To Set Up ...

*** Reverse Proxy

*** Forward Proxy

*** Coaching Server

*** Load Balancer

*** Firewall

** Learn Infrastructure as Code

*** Containers

*** Configuration and Management

*** Container Orchestration

*** Infrastructure Provisioning

** Learn Some CI/CD Tools

*** Jenkins

*** Travis CI

*** Teamcit

*** Drone

*** Circle CI

** Learn How to Monitor Software and Infrastructure

*** Infrastructure Monitoring

*** Application Monitoring

*** Logs Management

** Cloud Providers

*** AWS

*** Google Cloud

*** Azure

*** Digital Ocean

*** Heroku

** Keep Exploring

* Wrap Up
  If you think any of the roadmaps can be improved, please do open a PR with
  any updates and submit any issues. Also, I will continue to improve this, so
  you might want to watch/star this repository to revisit.

