dev-roadmap.html
<li><a id="org3c074bf"></a>Elixir<br></li>

<li><a id="org1ab3ac8"></a>Scala<br></li>

<li><a id="orga04dc6b"></a>Erlang<br></li>

<li><a id="org3f8b2e7"></a>Clojure<br></li>

<li><a id="org2576952"></a>Haskell<br></li>
</ol>
</div>

<div id="outline-container-org0758901" class="outline-4">
<h4 id="org0758901"><span class="section-number-4">3.1.3</span> Other Options</h4>
<div class="outline-text-4" id="text-3-1-3">
</div>
<ol class="org-ol">
<li><a id="org29040a1"></a>Java<br></li>

<li><a id="orgef23aa8"></a>.NET<br></li>

<li><a id="org8685b3d"></a>Golang<br></li>

<li><a id="org76a7348"></a>Rust<br></li>
</ol>
</div>
</div>

<div id="outline-container-orgd774458" class="outline-3">
<h3 id="orgd774458"><span class="section-number-3">3.2</span> Practice What You Learnt</h3>
</div>

<div id="outline-container-orge3543c3" class="outline-3">
<h3 id="orge3543c3"><span class="section-number-3">3.3</span> Learn Package Manager</h3>
</div>

<div id="outline-container-org8c6478a" class="outline-3">
<h3 id="org8c6478a"><span class="section-number-3">3.4</span> Standards and Best Practices</h3>
</div>

<div id="outline-container-orgeef984b" class="outline-3">
<h3 id="orgeef984b"><span class="section-number-3">3.5</span> Make and Distribute Some Package or Library</h3>
</div>

<div id="outline-container-orgaa39992" class="outline-3">
<h3 id="orgaa39992"><span class="section-number-3">3.6</span> Learn About Testing</h3>
</div>

<div id="outline-container-orgefc6b45" class="outline-3">
<h3 id="orgefc6b45"><span class="section-number-3">3.7</span> Write Tests for the Practical Steps Above</h3>
</div>

<div id="outline-container-org313f3e8" class="outline-3">
<h3 id="org313f3e8"><span class="section-number-3">3.8</span> Learn Relational Databases</h3>
</div>

<div id="outline-container-org8fe1292" class="outline-3">
<h3 id="org8fe1292"><span class="section-number-3">3.9</span> Practical Time</h3>
</div>

<div id="outline-container-org65b56e7" class="outline-3">
<h3 id="org65b56e7"><span class="section-number-3">3.10</span> Learn a Framework</h3>
</div>

<div id="outline-container-org2db0d2b" class="outline-3">
<h3 id="org2db0d2b"><span class="section-number-3">3.11</span> Practical Time</h3>
</div>

<div id="outline-container-orga953464" class="outline-3">
<h3 id="orga953464"><span class="section-number-3">3.12</span> Learn a NoSQL Database</h3>
</div>

<div id="outline-container-orgbf88e1d" class="outline-3">
<h3 id="orgbf88e1d"><span class="section-number-3">3.13</span> Coaching</h3>
</div>

<div id="outline-container-org2d85c31" class="outline-3">
<h3 id="org2d85c31"><span class="section-number-3">3.14</span> Creating RESTful APIs</h3>
</div>

<div id="outline-container-org42e5dcd" class="outline-3">
<h3 id="org42e5dcd"><span class="section-number-3">3.15</span> Authentication/Authorizations Methodologies</h3>
</div>

<div id="outline-container-orga2d7cd2" class="outline-3">
<h3 id="orga2d7cd2"><span class="section-number-3">3.16</span> Message Brokers</h3>
</div>

<div id="outline-container-org6acbe6b" class="outline-3">
<h3 id="org6acbe6b"><span class="section-number-3">3.17</span> Learn a Search Engine</h3>
</div>

<div id="outline-container-orgc1853b4" class="outline-3">
<h3 id="orgc1853b4"><span class="section-number-3">3.18</span> Learn How to User Docker</h3>
</div>

<div id="outline-container-orge0fc542" class="outline-3">
<h3 id="orge0fc542"><span class="section-number-3">3.19</span> Knowledge of Web Servers</h3>
</div>

<div id="outline-container-org2031922" class="outline-3">
<h3 id="org2031922"><span class="section-number-3">3.20</span> Learn How to Use Web Sockets</h3>
</div>

<div id="outline-container-org4cc0f1b" class="outline-3">
<h3 id="org4cc0f1b"><span class="section-number-3">3.21</span> Learn GraphQL</h3>
</div>

<div id="outline-container-org61da402" class="outline-3">
<h3 id="org61da402"><span class="section-number-3">3.22</span> Look Into Graph Databases</h3>
</div>

<div id="outline-container-orgd40f678" class="outline-3">
<h3 id="orgd40f678"><span class="section-number-3">3.23</span> All Things Not Mentioned Above</h3>
</div>

<div id="outline-container-orged45806" class="outline-3">
<h3 id="orged45806"><span class="section-number-3">3.24</span> Keep Exploring</h3>
</div>
</div>

<div id="outline-container-org2d8276d" class="outline-2">
<h2 id="org2d8276d"><span class="section-number-2">4</span> DevOps Roadmap</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7ac2792" class="outline-3">
<h3 id="org7ac2792"><span class="section-number-3">4.1</span> Learn a Programming Language</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org1c2f9c1" class="outline-4">
<h4 id="org1c2f9c1"><span class="section-number-4">4.1.1</span> Go</h4>
</div>

<div id="outline-container-orgfdaac28" class="outline-4">
<h4 id="orgfdaac28"><span class="section-number-4">4.1.2</span> Rust</h4>
</div>

<div id="outline-container-org0029ab2" class="outline-4">
<h4 id="org0029ab2"><span class="section-number-4">4.1.3</span> C C++</h4>
</div>

<div id="outline-container-org68fca0e" class="outline-4">
<h4 id="org68fca0e"><span class="section-number-4">4.1.4</span> Python</h4>
</div>

<div id="outline-container-org0612b39" class="outline-4">
<h4 id="org0612b39"><span class="section-number-4">4.1.5</span> Ruby</h4>
</div>

<div id="outline-container-org3a6893c" class="outline-4">
<h4 id="org3a6893c"><span class="section-number-4">4.1.6</span> Node.js</h4>
</div>
</div>

<div id="outline-container-orge7a97d9" class="outline-3">
<h3 id="orge7a97d9"><span class="section-number-3">4.2</span> Understand Different OS Concepts</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org93b36fd" class="outline-4">
<h4 id="org93b36fd"><span class="section-number-4">4.2.1</span> I/O Management</h4>
</div>

<div id="outline-container-orgfe7dcaa" class="outline-4">
<h4 id="orgfe7dcaa"><span class="section-number-4">4.2.2</span> Virtualization</h4>
</div>

<div id="outline-container-org6b67850" class="outline-4">
<h4 id="org6b67850"><span class="section-number-4">4.2.3</span> Memory and Storage</h4>
</div>

<div id="outline-container-org260f097" class="outline-4">
<h4 id="org260f097"><span class="section-number-4">4.2.4</span> File Systems</h4>
</div>

<div id="outline-container-org41cc5f9" class="outline-4">
<h4 id="org41cc5f9"><span class="section-number-4">4.2.5</span> Process Management</h4>
</div>

<div id="outline-container-orgfd20121" class="outline-4">
<h4 id="orgfd20121"><span class="section-number-4">4.2.6</span> Threads and Concurrency</h4>
</div>

<div id="outline-container-orgbbb1dca" class="outline-4">
<h4 id="orgbbb1dca"><span class="section-number-4">4.2.7</span> Sockets</h4>
</div>
</div>

<div id="outline-container-org3c38647" class="outline-3">
<h3 id="org3c38647"><span class="section-number-3">4.3</span> Learn About Managing Servers</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgb2c291c" class="outline-4">
<h4 id="orgb2c291c"><span class="section-number-4">4.3.1</span> Operating Systems</h4>
<div class="outline-text-4" id="text-4-3-1">
</div>
<ol class="org-ol">
<li><a id="org7e1cfc1"></a>Linux<br></li>

<li><a id="org53b3364"></a>Unix<br></li>

<li><a id="orgaea3d4f"></a>Windows<br></li>
</ol>
</div>

<div id="outline-container-org555f192" class="outline-4">
<h4 id="org555f192"><span class="section-number-4">4.3.2</span> Learn to Live in Terminal</h4>
<div class="outline-text-4" id="text-4-3-2">
</div>
<ol class="org-ol">
<li><a id="org260f632"></a>Bash Scripting<br></li>

<li><a id="org07a4305"></a>Vim/Nano/PowerShell/Emacs<br></li>

<li><a id="org4b2a958"></a>Compiling Apps from Source<br></li>

<li><a id="orge001a36"></a>System Performance<br></li>

<li><a id="orgaeb7ecc"></a>Others<br></li>
</ol>
</div>
</div>

<div id="outline-container-org954210b" class="outline-3">
<h3 id="org954210b"><span class="section-number-3">4.4</span> Networking and Security</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org7a57ced" class="outline-4">
<h4 id="org7a57ced"><span class="section-number-4">4.4.1</span> OSI Model</h4>
</div>

<div id="outline-container-org79855b3" class="outline-4">
<h4 id="org79855b3"><span class="section-number-4">4.4.2</span> DNS</h4>
</div>

<div id="outline-container-org41bcd0e" class="outline-4">
<h4 id="org41bcd0e"><span class="section-number-4">4.4.3</span> HTTP/S</h4>
</div>

<div id="outline-container-org8951aa8" class="outline-4">
<h4 id="org8951aa8"><span class="section-number-4">4.4.4</span> FTP</h4>
</div>

<div id="outline-container-orga4c35eb" class="outline-4">
<h4 id="orga4c35eb"><span class="section-number-4">4.4.5</span> SSL/TLS</h4>
</div>
</div>

<div id="outline-container-org05c601e" class="outline-3">
<h3 id="org05c601e"><span class="section-number-3">4.5</span> What Is and How To Set Up &#x2026;</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org62b3952" class="outline-4">
<h4 id="org62b3952"><span class="section-number-4">4.5.1</span> Reverse Proxy</h4>
</div>

<div id="outline-container-org4d8cd70" class="outline-4">
<h4 id="org4d8cd70"><span class="section-number-4">4.5.2</span> Forward Proxy</h4>
</div>

<div id="outline-container-org304c491" class="outline-4">
<h4 id="org304c491"><span class="section-number-4">4.5.3</span> Coaching Server</h4>
</div>

<div id="outline-container-orgdd1dcc1" class="outline-4">
<h4 id="orgdd1dcc1"><span class="section-number-4">4.5.4</span> Load Balancer</h4>
</div>

<div id="outline-container-orgca79bd9" class="outline-4">
<h4 id="orgca79bd9"><span class="section-number-4">4.5.5</span> Firewall</h4>
</div>
</div>

<div id="outline-container-org445a137" class="outline-3">
<h3 id="org445a137"><span class="section-number-3">4.6</span> Learn Infrastructure as Code</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org4c4b01d" class="outline-4">
<h4 id="org4c4b01d"><span class="section-number-4">4.6.1</span> Containers</h4>
</div>

<div id="outline-container-orgb4070f5" class="outline-4">
<h4 id="orgb4070f5"><span class="section-number-4">4.6.2</span> Configuration and Management</h4>
</div>

<div id="outline-container-org1bd93e1" class="outline-4">
<h4 id="org1bd93e1"><span class="section-number-4">4.6.3</span> Container Orchestration</h4>
</div>

<div id="outline-container-orgff9a2ea" class="outline-4">
<h4 id="orgff9a2ea"><span class="section-number-4">4.6.4</span> Infrastructure Provisioning</h4>
</div>
</div>

<div id="outline-container-org2ff3e3a" class="outline-3">
<h3 id="org2ff3e3a"><span class="section-number-3">4.7</span> Learn Some CI/CD Tools</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-org500eb2d" class="outline-4">
<h4 id="org500eb2d"><span class="section-number-4">4.7.1</span> Jenkins</h4>
</div>

<div id="outline-container-orgbf01b47" class="outline-4">
<h4 id="orgbf01b47"><span class="section-number-4">4.7.2</span> Travis CI</h4>
</div>

<div id="outline-container-orga8cefbe" class="outline-4">
<h4 id="orga8cefbe"><span class="section-number-4">4.7.3</span> Teamcit</h4>
</div>

<div id="outline-container-org3cb196a" class="outline-4">
<h4 id="org3cb196a"><span class="section-number-4">4.7.4</span> Drone</h4>
</div>

<div id="outline-container-org8efe266" class="outline-4">
<h4 id="org8efe266"><span class="section-number-4">4.7.5</span> Circle CI</h4>
</div>
</div>

<div id="outline-container-org89f8184" class="outline-3">
<h3 id="org89f8184"><span class="section-number-3">4.8</span> Learn How to Monitor Software and Infrastructure</h3>
<div class="outline-text-3" id="text-4-8">
</div>
<div id="outline-container-org5e8c2cd" class="outline-4">
<h4 id="org5e8c2cd"><span class="section-number-4">4.8.1</span> Infrastructure Monitoring</h4>
</div>

<div id="outline-container-org1f5031c" class="outline-4">
<h4 id="org1f5031c"><span class="section-number-4">4.8.2</span> Application Monitoring</h4>
</div>

<div id="outline-container-org5c9e072" class="outline-4">
<h4 id="org5c9e072"><span class="section-number-4">4.8.3</span> Logs Management</h4>
</div>
</div>

<div id="outline-container-org167000b" class="outline-3">
<h3 id="org167000b"><span class="section-number-3">4.9</span> Cloud Providers</h3>
<div class="outline-text-3" id="text-4-9">
</div>
<div id="outline-container-orgd5a07ce" class="outline-4">
<h4 id="orgd5a07ce"><span class="section-number-4">4.9.1</span> AWS</h4>
</div>

<div id="outline-container-org59a7377" class="outline-4">
<h4 id="org59a7377"><span class="section-number-4">4.9.2</span> Google Cloud</h4>
</div>

<div id="outline-container-orgdc0b001" class="outline-4">
<h4 id="orgdc0b001"><span class="section-number-4">4.9.3</span> Azure</h4>
</div>

<div id="outline-container-orgaf7eb22" class="outline-4">
<h4 id="orgaf7eb22"><span class="section-number-4">4.9.4</span> Digital Ocean</h4>
</div>

<div id="outline-container-org07c8a79" class="outline-4">
<h4 id="org07c8a79"><span class="section-number-4">4.9.5</span> Heroku</h4>
</div>
</div>

<div id="outline-container-orgee4a01e" class="outline-3">
<h3 id="orgee4a01e"><span class="section-number-3">4.10</span> Keep Exploring</h3>
</div>
</div>

<div id="outline-container-org8312a2e" class="outline-2">
<h2 id="org8312a2e"><span class="section-number-2">5</span> Wrap Up</h2>
<div class="outline-text-2" id="text-5">
<p>
If you think any of the roadmaps can be improved, please do open a PR with
any updates and submit any issues. Also, I will continue to improve this, so
you might want to watch/star this repository to revisit.
</p>
</div>
</div>
