dev-roadmap.html

<div id="outline-container-orgcb708d4" class="outline-2">
<h2 id="orgcb708d4"><span class="section-number-2">6</span> Contribution</h2>
<div class="outline-text-2" id="text-6">
<p>
Have a look at <a href="https://github.com/kamranahmedse/developer-roadmap/blob/master/contributing.md">contribution docs</a> for how to update any of the roadmaps.
</p>

<ul class="org-ul">
<li>Open pull request with improvements</li>
<li>Discuss ideas in issues</li>
<li>Spread the word</li>
<li>Reach out with any feedback</li>
</ul>
</div>
</div>

<div id="outline-container-org3f92ef8" class="outline-2">
<h2 id="org3f92ef8"><span class="section-number-2">7</span> Sponsored By</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://hackr.io/">Hackr.io - Find &amp; Share the Best Online Programming Courses &amp; Tutorials</a></li>
</ul>
</div>
</div>

<div id="outline-container-org583ffbb" class="outline-2">
<h2 id="org583ffbb"><span class="section-number-2">8</span> License</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">https://creativecommons.org/licenses/by-nc-sa/4.0/</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: January 4, 2019</p>
<p class="author">Author: Kamran Ahmed</p>
<p class="date">Created: 2019-01-12 Sat 10:14</p>
<p class="creator">WLHarvey4</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
